tests/cases/fillTime/0/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;
boundaryField
{
    inlet1  { type fixedValue; value uniform 480; }
    inlet2  { type zeroGradient; }
    vent    { type inletOutlet; inletValue uniform 300; value uniform 300; }
    walls   { type fixedValue; value uniform 353; }
}
