tests/cases/fillTime/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale   1;

vertices
(
    (0      0     0)
    (0.019  0     0)
    (0.021  0     0)
    (0.04   0     0)
    (0      0.004 0)
    (0.019  0.004 0)
    (0.021  0.004 0)
    (0.04   0.004 0)
    (0      0     0.002)
    (0.019  0     0.002)
    (0.021  0     0.002)
    (0.04   0     0.002)
    (0      0.004 0.002)
    (0.019  0.004 0.002)
    (0.021  0.004 0.002)
    (0.04   0.004 0.002)
);

blocks
(
    hex (0 1 5 4 8 9 13 12)   (38 8 1) simpleGrading (1 1 1)
    hex (1 2 6 5 9 10 14 13)  (4  8 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (38 8 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet1
    {
        type patch;
        faces ((0 4 12 8));
    }

    inlet2
    {
        type patch;
        faces ((3 7 15 11));
    }

    vent
    {
        type patch;
        faces ((5 6 14 13));
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (4 5 13 12)
            (6 7 15 14)
        );
    }
);
