tests/cases/fillTime/system/expectedPatterns
moldingFoam: filling
End
