tests/cases/fillTime/system/verifyScript
verify-fill-time.py
